{"pageProps":{"post":{"title":"150k - CSGORoll Giveaway 🥳","excerpt":"February 20th, 2020 was a special date for us. And to celebrate this journey, check out the exciting events we've prepared for you up until February 27th! JACKPOT To participate in our Jackpot, all you need to do is collect Jackpot tickets. We'll rew","content_html":"<section class=\"post-full-content\">\n<div class=\"post-content\">\n<p>\n   February 20th, 2020 was a special date for us. And to celebrate this journey, check out the exciting events we've prepared for you up until February 27th!\n  </p>\n<hr>\n<h3 id=\"jackpot\">\n   JACKPOT\n  </h3>\n<p>\n   To participate in our Jackpot, all you need to do is collect Jackpot tickets. We'll reward you with a Jackpot ticket for every gem spent in our\n   <a href=\"https://csgoroll.com/r/4tmr\">\n    Gem Store\n   </a>\n   over the duration of this event. &nbsp;So make sure you collect as many as possible by playing, and remember to spend them before the Jackpot is drawn!\n  </p>\n<ul>\n<li>\n<strong>\n     Jackpot 1:\n    </strong>\n    30k - Feb 23rd at 8 pm CET\n   </li>\n<li>\n<strong>\n     Jackpot 2:\n    </strong>\n    50k - Feb 27th at 8 pm CET\n   </li>\n</ul>\n<h3 id=\"leaderboard\">\n   LEADERBOARD\n  </h3>\n<p>\n   For the top 10 Gem collectors over the week, there are 50k coins in total up for grabs. Here's what you could win!\n  </p>\n<ol>\n<li>\n    25,000\n   </li>\n<li>\n    11,250\n   </li>\n<li>\n    6,250\n   </li>\n<li>\n    3,000\n   </li>\n<li>\n    1,750\n   </li>\n<li>\n    1,250\n   </li>\n<li>\n    750\n   </li>\n<li>\n    375\n   </li>\n<li>\n    250\n   </li>\n<li>\n    125\n   </li>\n</ol>\n<p>\n   Gem leaderboard counting is from today (20th) at 6 pm UTC to the 27th at 6 pm UTC\n  </p>\n<h3 id=\"progress-bar\">\n   PROGRESS BAR\n  </h3>\n<p>\n   As higher bets are placed, the progress bar will slowly fill. When the bar is full, it will trigger the next drop of Gems in the chat for 10 lucky users to benefit from!\n  </p>\n<figure class=\"kg-card kg-image-card\">\n<img alt=\"\" height=\"155\" loading=\"lazy\" sizes=\"(min-width: 720px) 720px\" src=\"https://s.4tr.cc/iNjWyuOS.png\" width=\"783\">\n</figure>\n<h3 id=\"daily-streams\">\n   DAILY STREAMS\n  </h3>\n<p>\n   The fun doesn't stop there! Join us daily from 7 pm CET for some more challenges and events at\n   \n    https://twitch.tv/csgorollcom\n   \n   .\n  </p>\n<p>\n   Our hosts have prepared some fun events and CS:GO challenges for you to participate in, as well as some cool events over the stream duration.\n  </p>\n<hr>\n<h2 id=\"team-note\">\n   Team note\n  </h2>\n<p>\n   All of us at CSGORoll want to say a huge thank you for being part of the amazing community we've built together. Our incredible events are only possible because of your constant support and willingness to follow our journey.\n  </p>\n<p>\n   As we plan on being here for many years to come, we always listen to the problems you face on our site. And though a reported lag in performance and small improvements have been pending due to our priorities, we've now made it our absolute mission to solve them.\n  </p>\n<p>\n   We're dedicating time and resources to improving the performance of CSGORoll to make sure that your experience continues to be positive and flawless. We're even allocating some of the resources that would be used for other events, including our anniversary and Easter, for something bigger.\n  </p>\n<p>\n   You may have noticed improvements over the past weeks, but there's still more to come. And as promised, once the site performance is fully improved we'll host a HUGE giveaway to celebrate!\n  </p>\n<figure class=\"kg-card kg-embed-card\">\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\n     Once our lag is fixed we're doing a 1 million giveaway\n    </p>\n    — CSGORoll (@CSGORoll)\n    <a href=\"https://twitter.com/CSGORoll/status/1623753872643612673?ref_src=twsrc%5Etfw&amp;ref=csgoroll-official-blog\">\n     February 9, 2023\n    </a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\">\n</script>\n</figure>\n<p>\n   We're sure you don't want to miss out, so stay tuned on our socials.\n  </p>\n<p>\n   Once again, we thank each of you for another year of CSGORoll. Here's to the next 3, and the best community there is!\n  </p>\n</div>\n</section>"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"CSGORoll","name":"CSGORoll | Win CSGO skins at the world's longest established CSGO game site!","description":"Play with the biggest, best and most trusted CSGO game operator. CSGORoll offers an amazing online experience to win skins.","avatar":"4WTiDjwI","promos":[{"code":"4tmr","bonus":"3 free cases and a 5% bonus added to all cash deposits.","uid":"fu9Z6oNW"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Privacy","url":"/privacy","order":0}],"__N_SSG":true}