{"pageProps":{"post":{"title":"(Expired) DESIGN COMPETITION - Withdraw page 🖌️","excerpt":"Would you like to win $1000 USDT? This is the time to show your talent and problem solving skills! Although CSGORoll is a trade-friendly website, it doesn't convert that to design very well, but it's time to change. The community has been offering su","content_html":"<section class=\"post-full-content\">\n<div class=\"post-content\">\n<h3 id=\"would-you-like-to-win-1000-usdt-this-is-the-time-to-show-your-talent-and-problem-solving-skills-\">\n   Would you like to win $1000 USDT? This is the time to show your talent and problem solving skills!\n  </h3>\n<p>\n</p>\n<p>\n   Although CSGORoll is a trade-friendly website, it doesn't convert that to design very well, but it's time to change. The community has been offering suggestions up close, so we thought, why not give them the power to design the way they want?\n  </p>\n<figure class=\"kg-card kg-image-card kg-width-wide kg-card-hascaption\">\n<img alt=\"\" height=\"1000\" loading=\"lazy\" sizes=\"(min-width: 1200px) 1200px\" src=\"https://s.4tr.cc/zFIiGAoJ.png\" width=\"1881\">\n<figcaption>\n    CSGORoll withdraw page\n   </figcaption>\n</figure>\n<p>\n   This will be a UI/UX Framework Design competition for the withdrawal page. Do you think you can solve this? For this challenge, you will have to explore your creativity and problem solving skills and here is a list of what we want to achieve with this competition:\n  </p>\n<ul>\n<li>\n    Clear withdraw interface for new customers;\n   </li>\n<li>\n    Improved filters for item selection, such as; Type, Exterior, Stickers, and Mark-up %;\n   </li>\n<li>\n    Improved order-by functionality, such as; float value, and lowest mark-up;\n   </li>\n<li>\n    A better user experience for the players and traders where they have full control over what they select for the marketplace.\n   </li>\n</ul>\n<p>\n\n    Click here for more details about the filters\n   \n   . The real challenge is to come up with the best functional marketplace flow you can think of, allowing the customer to sort their items without making it too complex. This way, you don't have to worry about styling the design and can focus on problem-solving.\n  </p>\n<figure class=\"kg-card kg-image-card kg-card-hascaption\">\n<img alt=\"\" height=\"384\" loading=\"lazy\" src=\"https://s.4tr.cc/37Nh1EHt.png\" width=\"202\">\n<figcaption>\n    Source: cs.money\n   </figcaption>\n</figure>\n<figure class=\"kg-card kg-image-card kg-card-hascaption\">\n<img alt=\"\" height=\"455\" loading=\"lazy\" sizes=\"(min-width: 720px) 720px\" src=\"https://s.4tr.cc/2EmUfKs4.png\" width=\"1284\">\n<figcaption>\n    Source: BitSkins\n   </figcaption>\n</figure>\n<figure class=\"kg-card kg-image-card kg-card-hascaption\">\n<img alt=\"\" height=\"857\" loading=\"lazy\" src=\"https://s.4tr.cc/a9uVpPpv.png\" width=\"463\">\n<figcaption>\n    Source: SkinBaron\n   </figcaption>\n</figure>\n<figure class=\"kg-card kg-image-card kg-card-hascaption\">\n<img alt=\"\" height=\"507\" loading=\"lazy\" src=\"https://s.4tr.cc/wjS6c1NO.png\" width=\"684\">\n<figcaption>\n    Source: Steam Marketplace\n   </figcaption>\n</figure>\n<p>\n   The examples above are from different marketplaces just to provide a filter reference as they do not have any relation with CSGORoll directly. Keep in mind that CSGORoll is focused horizontally instead of vertically, so don't limit yourself to the example provided.\n  </p>\n<hr>\n<h3 id=\"how-to-participate\">\n   How to participate?\n  </h3>\n<p>\n   You will have until\n   <strong>\n    April 30th\n   </strong>\n   to send your ideas by replying to this tweet with your design suggestions and text explaining the idea you are following to solve the problem, the design best suited to the needs of the page will receive $\n   <strong>\n    1000 USDT\n   </strong>\n   .\n  </p>\n<p>\n   Only entries sent as a reply to the tweet will be considered valid. On\n   <strong>\n    April 30th\n   </strong>\n   we will close and start reviewing all entries to announce the winners within the next few days after reviewing all entries.\n  </p>\n<hr>\n<p>\n   We are excited to see how you are solving the problem and your design skills, we know that our community is full of hidden talents.\n  </p>\n<p>\n   Tag your friends to invite them to this challenge and interact with your favorite posts by telling the designer how they can improve with valuable feedback. Let's start!\n  </p>\n</div>\n</section>"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"CSGORoll","name":"CSGORoll | Win CSGO skins at the world's longest established CSGO game site!","description":"Play with the biggest, best and most trusted CSGO game operator. CSGORoll offers an amazing online experience to win skins.","avatar":"4WTiDjwI","promos":[{"code":"4tmr","bonus":"3 free cases and a 5% bonus added to all cash deposits.","uid":"fu9Z6oNW"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Privacy","url":"/privacy","order":0}],"__N_SSG":true}