{"pageProps":{"post":{"title":"Double XP and Daily Reward Updates","excerpt":"Get ready to reach higher levels with our first double experience weekend event! Double XP event We are about to start our first weekend of double experience at CSGORoll, during this period all bets placed will reward twice as much experience as usua","content_html":"<section class=\"post-full-content\">\n<div class=\"post-content\">\n<p>\n   Get ready to reach higher levels with our first double experience weekend event!\n  </p>\n<hr>\n<h3 id=\"double-xp-event\">\n   Double XP event\n  </h3>\n<p>\n   We are about to start our first weekend of double experience at CSGORoll, during this period all bets placed will reward twice as much experience as usual giving you 800 EXP per coin wagered. After months of great giveaways, we decided to invest our resources in short-term promotions that would benefit more players and spread the benefits to everyone. Don't miss the chance, you never know when it might happen again!\n  </p>\n<h3 id=\"benefit-of-levels\">\n   Benefit of levels\n  </h3>\n<p>\n   By playing the games available on CSGORoll, you will earn experience points to reach levels that will offer you several benefits: From daily rewards to special giveaways available only to users at a certain level and chat drops. For this reason, you should make the most of the double experience weekend to guarantee your place in future events, such as our\n   \n    In-game events\n   \n   available to level 20+ users.\n  </p>\n<h3 id=\"daily-reward-updates\">\n   Daily Reward Updates\n  </h3>\n<p>\n   In order to offer the double experience event, we had to change some calculations and update the reward system based on the levels. You will notice some changes to the case prizes and here is the reason:\n  </p>\n<p>\n   Initially, we made our free daily rewards using the 2020 skin prices, but since then the average price has gone up by more than 30%, which means that our rewards were paying more than we originally planned. In addition, it was using a static experience system that prevented us from doing XP weekends, otherwise, it would be just too expensive, after all the daily rewards are a Rakeback based on the amount you wager to reach that level. To find good middle ground, we subsidized the average daily free rewards conservatively in order to host these double XP events.\n  </p>\n<p>\n   It is important to note that we have always been transparent in mentioning that our daily rewards were subject to change, but for sure we would always find a fair solution for both sides.\n  </p>\n<figure class=\"kg-card kg-image-card kg-width-wide\">\n<img alt=\"\" height=\"162\" loading=\"lazy\" src=\"https://s.4tr.cc/pFl5i3nX.png\" width=\"1086\">\n</figure>\n<hr>\n<p>\n   We hope you enjoy and level up as much as you can this weekend, we are excited to see more users reaching big levels!\n  </p>\n</div>\n</section>"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"CSGORoll","name":"CSGORoll | Win CSGO skins at the world's longest established CSGO game site!","description":"Play with the biggest, best and most trusted CSGO game operator. CSGORoll offers an amazing online experience to win skins.","avatar":"4WTiDjwI","promos":[{"code":"4tmr","bonus":"3 free cases and a 5% bonus added to all cash deposits.","uid":"fu9Z6oNW"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Privacy","url":"/privacy","order":0}],"__N_SSG":true}