{"pageProps":{"post":{"title":"Black Weekend - CSGORoll","excerpt":"Looking for a Black Friday deal? Here's your best one yet! This Black Friday, there's great deals all round! But rumour has it that ours is one of the best... From the 26th to the 29th of November, all of our cases will have a 5% discount removed fro","content_html":"<section>\n<div>\n<p>\n   Looking for a Black Friday deal? Here's your best one yet!\n  </p>\n<hr>\n<p>\n   This Black Friday, there's great deals all round! But rumour has it that ours is one of the best... From the 26th to the 29th of November, all of our cases will have a 5% discount removed from their total value! And if you think it doesn't sound like a big deal, that's where you're wrong. This discount slashes our house edge in half! Excited yet?\n  </p>\n<p>\n   With our house edge cut in half, you're getting a lot more for your bucks.\n  </p>\n<figure>\n<img alt=\"\" height=\"1079\" loading=\"lazy\" sizes=\"(min-width: 720px) 720px\" src=\"https://s.4tr.cc/yvnGdZ93.png\" width=\"1875\">\n</figure>\n<p>\n   This 5% discount will apply globally to all cases available on <a href=\"https://bit.ly/3wZPazZ\" target=\"_blank\">CSGORoll</a>. And as it's available all weekend, its a promotion worth getting excited about. Specifically in PvP Games, where your favourite cases will cost less to take to battle!\n  </p>\n<p>\n   This is the first promotion of its kind on <a href=\"https://bit.ly/3wZPazZ\" target=\"_blank\">CSGORoll</a>, and we hope you're as excited about it as we are. With Christmas on the horizon, it won't be the last event to come this side of 2021 either... but we're keeping tight lipped for now.\n  </p>\n<p>\n   Set your alarms for the 26th November at 0:01 UTC; we'll see you there!\n  </p>\n</div>\n</section>"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"CSGORoll","name":"CSGORoll | Win CSGO skins at the world's longest established CSGO game site!","description":"Play with the biggest, best and most trusted CSGO game operator. CSGORoll offers an amazing online experience to win skins.","avatar":"4WTiDjwI","promos":[{"code":"4tmr","bonus":"3 free cases and a 5% bonus added to all cash deposits.","uid":"fu9Z6oNW"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Privacy","url":"/privacy","order":0}],"__N_SSG":true}