{"pageProps":{"post":{"title":"CSGORoll Affiliate System 2.0","excerpt":"You asked, and we delivered. Deposit bonuses and more are now available on CSGORoll! New Affiliate System We've always been proud of our affiliate system. But we understand that it mainly benefitted a specific group of people; those that had taken ad","content_html":"<section class=\"post-full-content\">\n<div class=\"post-content\">\n<p>\n   You asked, and we delivered. Deposit bonuses and more are now available on CSGORoll!\n  </p>\n<h2 id=\"new-affiliate-system\">\n   New Affiliate System\n  </h2>\n<p>\n   We've always been proud of our affiliate system. But we understand that it mainly benefitted a specific group of people; those that had taken advantage in our earlier days by easing their efforts once they'd collected enough users.\n  </p>\n<p>\n   When designing our new affiliate system, we had you in mind. We considered our long-term users: the users that consistently go out of their way to promote CSGORoll.\n  </p>\n<p>\n   So, we're excited to announce that instead of only receiving a free box upon registration, you'll now be granted a deposit bonus too! With this, you can support your favourite code owner multiple times. And if you're a creator, don't panic! Our OG users are no longer limited to one code... so get promoting!\n  </p>\n<h3 id=\"deposit-bonus\">\n   Deposit Bonus\n  </h3>\n<p>\n   You can now redeem an extra 5% bonus on your deposits by entering your favourite creators code when depositing!\n  </p>\n<p>\n<em>\n    *It's important to note that your limit is $100 bonus per deposit. This bonus doesn't cover deposits using Gift Cards or CS:GO skins; only direct payments are accepted.\n   </em>\n</p>\n<figure class=\"kg-card kg-image-card\">\n<img alt=\"\" height=\"160\" loading=\"lazy\" sizes=\"(min-width: 720px) 720px\" src=\"https://s.4tr.cc/bNXXfsz9.png\" width=\"1065\">\n</figure>\n<h3 id=\"tier-and-commission-changes\">\n   Tier and Commission Changes\n  </h3>\n<p>\n   You can wave goodbye to static referrals! Instead of wagers, our new commission is based on deposits! This new system gives users that consistently advertise their code a higher chance to reach everyone: new and old, alike.\n  </p>\n<figure class=\"kg-card kg-image-card kg-width-wide\">\n<img alt=\"\" height=\"633\" loading=\"lazy\" src=\"https://s.4tr.cc/bIIHGgiF.png\" width=\"1056\">\n</figure>\n<figure class=\"kg-card kg-image-card kg-width-wide\">\n<img alt=\"\" height=\"338\" loading=\"lazy\" src=\"https://s.4tr.cc/srPgs3js.png\" width=\"1065\">\n</figure>\n<figure class=\"kg-card kg-image-card kg-width-wide\">\n<img alt=\"\" height=\"571\" loading=\"lazy\" src=\"https://s.4tr.cc/y674Kl9e.png\" width=\"1061\">\n</figure>\n<h3 id=\"affiliate-tier-requires-a-minimum-of-referrals-to-claim\">\n   Affiliate Tier Requires a Minimum of Referrals to Claim\n  </h3>\n<p>\n   We like to keep everything as simple as possible to ensure that everyone benefits. But to maintain the new changes, we had to update a few things.\n  </p>\n<p>\n   Now, you must have a number of active referrals with at least one valid deposit generating commission to claim your affiliate earnings. This will support the system in continuing in the long run, by ensuring that abuse isn't possible.\n  </p>\n<h2 id=\"referral-statuses\">\n   Referral statuses\n  </h2>\n<p>\n   To understand our affiliate system as best you can, here's what the status of each refferal means:\n  </p>\n<figure class=\"kg-card kg-image-card kg-width-wide\">\n<img alt=\"\" height=\"46\" loading=\"lazy\" src=\"https://s.4tr.cc/Tag6Pejk.png\" width=\"666\">\n</figure>\n<ul>\n<li>\n<strong>\n     UNCONVERTED:\n    </strong>\n    User has not had a valid deposit after redeeming your code for 3 free cases;\n   </li>\n<li>\n<strong>\n     ACTIVE:\n    </strong>\n    User redeemed your code and deposited over $1 in the last 14 days;\n   </li>\n<li>\n<strong>\n     STEALABLE:\n    </strong>\n    This user has not changed the code yet but also has not initiated new deposits. This is when you need to actively promote your code to try and reach them;\n   </li>\n<li>\n<strong>\n     STOLEN:\n    </strong>\n    User moved from your code to another, no longer generating commission or being a valid referral for your code.\n   </li>\n</ul>\n<hr>\n<p>\n   Remember, as we grow we must adapt our system to give everyone a chance to benefit. That's why every change we make is based on your feedback. After all, what is CSGORoll without its community?\n  </p>\n<p>\n   Remember to share your thoughts on our new changes on\n   \n    Discord\n   \n   and\n   <a href=\"https://twitter.com/csgoroll?ref=csgoroll-official-blog\">\n    Twitter\n   </a>\n   !\n  </p>\n<figure class=\"kg-card kg-embed-card\">\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">\n     Anyone newly promoting CSGORoll has probably found that they get little affiliate rewards since most people have used a code already. We will be gathering data for 1 month before changing anything, during which time we will be taking into consideration everyone's feedback!\n     <br>\n<br>\n     2/2\n    </p>\n    — CSGORoll 🔔 (@CSGORoll)\n    <a href=\"https://twitter.com/CSGORoll/status/1400808462041243655?ref_src=twsrc%5Etfw&amp;ref=csgoroll-official-blog\">\n     June 4, 2021\n    </a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\">\n</script>\n</figure>\n</div>\n</section>"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"CSGORoll","name":"CSGORoll | Win CSGO skins at the world's longest established CSGO game site!","description":"Play with the biggest, best and most trusted CSGO game operator. CSGORoll offers an amazing online experience to win skins.","avatar":"4WTiDjwI","promos":[{"code":"4tmr","bonus":"3 free cases and a 5% bonus added to all cash deposits.","uid":"fu9Z6oNW"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Privacy","url":"/privacy","order":0}],"__N_SSG":true}