{"pageProps":{"posts":[{"title":"Black Weekend - CSGORoll","excerpt":"Looking for a Black Friday deal? Here's your best one yet! This Black Friday, there's great deals all round! But rumour has it that ours is one of the best... From the 26th to the 29th of November, all of our cases will have a 5% discount removed fro","uri":"black-friday-csgoroll"},{"title":"400K Halloween Event - Week 4 ⚰️","excerpt":"That's all, folks. The 4th and final week of our Halloween event has come to an end, check it out! 100k Competition This week's competition had big names, all racing for the final pot. However, Casey collected over 169,000 candies on his way to level","uri":"400k-halloween-event-week-4"},{"title":"400K Halloween Event - Week 3 🕷️","excerpt":"Welcome to the third weeks' summary of our Halloween event . Check out what happened t his week and stay tuned for the next event taking place on October 31st ! 100k Competition Taking the big pot home, this weeks 50.000 coins goes to karavay192- tha","uri":"400k-halloween-event-week-3"},{"title":"400K Halloween Event - Week 2🕯️","excerpt":"Welcome to the second weeks' summary of our Halloween event . Check out what happened t his week and stay tuned for the next event taking place on October 22nd ! 100k Competition After a disputed first week, BIGWINPLEASE decided that this second week","uri":"400k-halloween-event-week-2"},{"title":"400K Halloween Event - Week 1👻","excerpt":"This is the first weeks' summary of our Halloween event . Check out what happened in the first week and stay tuned for the next event taking place on October 15th! 100k Competition This first week was disputed and fought until the last minute but Rai","uri":"400k-halloween-event-week-1"},{"title":"Halloween 400,000 Coins Giveaway","excerpt":"Are you ready for another spooktacular promotion? From weekly competitions to in-game events, here's what we've got planned for you this Halloween. 100k Weekly Competition Each week, our Witch, 'Red', will reward the top ten candy collectors on the C","uri":"400k-halloween-event"},{"title":"Summer Giveaway - 6th Week Winners (FINAL) 🎉","excerpt":"Check out what happened in the last weeks' summary of our Summer giveaway ! We would like to thank everyone who participated and helped in this event. As usual, it was a blast and all of this is only possible because of you, the community and the peo","uri":"summer-giveaway-6th-week-winners"},{"title":"Summer Giveaway - 5th Week Winners 🌅","excerpt":"Check out what happened in the fifth weeks' summary of our Summer giveaway ! Teams The team counter-terrorist is taking the top prize home for the first time in this event! A reminder that the MVP of each team guarantees a nice 5000 coins prize each.","uri":"summer-giveaway-5th-week-winners"},{"title":"Summer Giveaway - 4th Week Winners 😎","excerpt":"Check out what happened in the fourth weeks' summary of our Summer giveaway ! Teams You know how it goes, once again the team Chicken guaranteeing the first prize for the team! A reminder that the MVP of each team guarantees a nice 5000 coins prize e","uri":"summer-giveaway-4th-week-winners"},{"title":"Summer Giveaway - 3rd Week Winners 🌴","excerpt":"Check out what happened in the third weeks' summary of our Summer giveaway ! Teams You know how it goes, once again the team Chicken guaranteeing the first prize for the team! A reminder that the MVP of each team guarantees a nice 5000 coins prize ea","uri":"summer-giveaway-3rd-week-winners"}],"page":3,"count":42},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"CSGORoll","name":"CSGORoll | Win CSGO skins at the world's longest established CSGO game site!","description":"Play with the biggest, best and most trusted CSGO game operator. CSGORoll offers an amazing online experience to win skins.","avatar":"4WTiDjwI","promos":[{"code":"4tmr","bonus":"3 free cases and a 5% bonus added to all cash deposits.","uid":"fu9Z6oNW"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Privacy","url":"/privacy","order":0}],"__N_SSG":true}